#include <stdio.h>

int main() {
    //แสดงผลตัวอักษร 'a' ตามด้วยตัวเลขทศนิยม 3 ตำแหน่งเว้นช่องว่าง 6 ตัว
    printf("a=%6.3f%%\n", 0.67);

    //แสดงผลตัวอักษร 'b' ตามด้วยจำนวนเต็ม 4 หลัก (เติม 0 ข้างหน้า)เครื่องหมาย %
    printf("b=%4d%%\n", 25);

    //แสดงผลตัวอักษร 'c' ตามด้วยตัวเลขทศนิยม 3 ตำแหน่ง
    printf("c =%.3f%%\n", 19.0);

    //แสดงผลตัวอัการ 'd' ตามด้วยเลขจำนวนเต็ม 2 หลัก โดยจัดช้ายและมีเครื่องหมาย %
    printf("d =%-2d%%\n", 9);

    //แสดงผลผลตัวอักษร 'e' ตามด้วยเลขทศนิยม 3 ตำแหน่ง โดยเว้นช่องว่าง 7 ตัวทางด้านซ้าย
    printf("e=%7.3f%%\n", 124.555);

    //แสดงผลตัวอักษร 'f' ตามด้วยด้วยเลขทศนิยม 3 ตำแหน่ง โดยเว้นช่องว่าง 5 ตัวซ้าย
    printf("f=%5.3f%%\n",0.001);

    return 0; //จบโปรแกรมโดยส่งค่ากลับ 0
}